# Criando Nomes

In [1]:
import pandas as pd

In [2]:
nomes_m = pd.read_json("https://servicodados.ibge.gov.br/api/v1/censos/nomes/ranking?qtd=200&sexo=m")
nomes_f = pd.read_json("https://servicodados.ibge.gov.br/api/v1/censos/nomes/ranking?qtd=200&sexo=f")

In [3]:
nomes_m.head()

        nome  regiao     freq  rank sexo
0       JOSE       0  5732508     1    M
1       JOAO       0  2971935     2    M
2    ANTONIO       0  2567494     3    M
3  FRANCISCO       0  1765197     4    M
4     CARLOS       0  1483121     5    M

In [4]:
nomes_f.head()

        nome  regiao      freq  rank sexo
0      MARIA       0  11694738     1    F
1        ANA       0   3079729     2    F
2  FRANCISCA       0    721637     3    F
3    ANTONIA       0    588783     4    F
4    ADRIANA       0    565621     5    F

In [5]:
print(f"Quantidade total de nomes: {len(nomes_f) + len(nomes_m)}")

Quantidade total de nomes: 400

In [6]:
frames = [nomes_m, nomes_f]

In [7]:
frames

[          nome  regiao     freq  rank sexo
 0         JOSE       0  5732508     1    M
 1         JOAO       0  2971935     2    M
 2      ANTONIO       0  2567494     3    M
 3    FRANCISCO       0  1765197     4    M
 4       CARLOS       0  1483121     5    M
 ..         ...     ...      ...   ...  ...
 195     WALTER       0    67207   196    M
 196    ARLINDO       0    66669   197    M
 197    MICHAEL       0    65736   198    M
 198     ALVARO       0    65444   199    M
 199    GEOVANE       0    65435   200    M

 [200 rows x 5 columns],
           nome  regiao      freq  rank sexo
 0        MARIA       0  11694738     1    F
 1          ANA       0   3079729     2    F
 2    FRANCISCA       0    721637     3    F
 3      ANTONIA       0    588783     4    F
 4      ADRIANA       0    565621     5    F
 ..         ...     ...       ...   ...  ...
 195     ROSANE       0     82203   196    F
 196    IVONETE       0     81878   197    F
 197    LUCIANE       0     81230   198    F
 198    ISADORA       0     81100   199    F
 199      NILZA       0     80128   200    F

 [200 rows x 5 columns]]

In [8]:
nomes = pd.concat(frames)["nome"].to_frame()
nomes

          nome
0         JOSE
1         JOAO
2      ANTONIO
3    FRANCISCO
4       CARLOS
..         ...
195     ROSANE
196    IVONETE
197    LUCIANE
198    ISADORA
199      NILZA

[400 rows x 1 columns]

In [9]:
nomes.sample(5)

        nome
2    ANTONIO
17    FELIPE
181     YURI
110  LUCIENE
96     TANIA

# Incluindo ID dos alunos

In [10]:
import numpy as np

np.random.seed(42)

In [14]:
nomes["id"] = np.random.permutation(len(nomes)) + 1
nomes.sample(5)

        nome   id
18   VANESSA  284
49    ANGELA  321
61    BIANCA  265
157    JAIME  300
58      DAVI  261

In [20]:
dominios = ["@seudominio.com", "@dominando.com.br", "@apenasumdominio.com"]
nomes['dominio'] = np.random.choice(dominios, len(nomes))

In [21]:
nomes.sample(5)

          nome   id               dominio
114       ELZA   16  @apenasumdominio.com
83        EDNA   75     @dominando.com.br
141    ORLANDO  314       @seudominio.com
199      NILZA  264  @apenasumdominio.com
34   SEBASTIAO   98       @seudominio.com

In [28]:
nomes["email"] = nomes["nome"].str.cat(nomes["dominio"]).str.lower()

In [29]:
nomes.sample(10)

           nome   id               dominio                           email
115      MILTON  330  @apenasumdominio.com      milton@apenasumdominio.com
36       DEBORA  213  @apenasumdominio.com      debora@apenasumdominio.com
25     LEONARDO  248     @dominando.com.br       leonardo@dominando.com.br
35        CARLA  228       @seudominio.com            carla@seudominio.com
58   ALESSANDRA  282  @apenasumdominio.com  alessandra@apenasumdominio.com
124        LAIS  325  @apenasumdominio.com        lais@apenasumdominio.com
83         EDNA   75     @dominando.com.br           edna@dominando.com.br
23     FERNANDO  338  @apenasumdominio.com    fernando@apenasumdominio.com
172      REBECA   58  @apenasumdominio.com      rebeca@apenasumdominio.com
111     CLEITON   46     @dominando.com.br        cleiton@dominando.com.br